app/Controllers/Admin.php

  public function admin_settings()
  {
    $queryBuilder = $this->accountModel->select('*')
      ->get();
---
SELECT *
FROM `account`

            'TOTAL_ATTENDANCE' => 0,
            'ABSENCES' => 0,
          ];
          $this->studentModel->save($student_data);
---
INSERT INTO `student` (`FIRSTNAME`, `LASTNAME`, `MIDDLENAME`, `AGE`, `GENDER`, `QR`, `GRADE`, `LRN`, `SECTION`, `NUM_OF_PRESENT`, `NUMBER_OF_ABSENCES`, `TOTAL_ATTENDANCE`, `ABSENCES`) VALUES ('TESTING', 'TESTING', 'TESTING', '21', '1', '$2y$10$JYlxPmjjTdEIf1xSPfsjR.f.KYpqNl8iViK8yMwpL6qPwb5OGNrgi', '1', '2018-2197', 'Mercury', 0, 0, 0, 0)

  public function admin_teacher_subjects($id = 0){
    $queryBuilder = $this->teacherSectionsModel->query("SELECT * FROM teacher_sections ts
                      INNER JOIN gradesection g on g.ID = ts.GRADE_SECTION_ID
                      where ts.TEACHER_ID = $id");

    $querySections = $this->gradesectionModel->select("*")->get();
---
SELECT *
FROM `gradesection`