app/Controllers/Home.php

SELECT *
FROM `student`
---
    public function student_records()
    {
        $queryBuilder = $this->studentModel->select('*')
            ->get();

SELECT *
FROM `account`
WHERE `ID` = '2'
 LIMIT 1
---
    public function teacher_setting(){
        $id = session()->get('id');
        $getData = $this->accountModel->where('ID', $id)
                ->first();

SELECT *
FROM `event`
---
    public function event()
    {
        $queryBuilder = $this->eventModel->select('*')
            ->get();

UPDATE `account` SET `USERNAME` = 'Angelo', `PASSWORD` = '$2y$10$0WN3HFfoPGF6aZbFW0i6JOJ25y7Ug.s7oCYvFX4lzhTHyitzVg0Le'
WHERE `account`.`ID` IN ('2')
---
    public function update_teacher_info()
    {
        helper(['form']);
        if($this->request->getMethod() == "post"){
            $fName = $this->request->getVar('firstname');
            $lName = $this->request->getVar('lastname');
            $age = $this->request->getVar('age');
            $id = $this->request->getVar('id');

            $teacherData = [
                "FNAME" => $fName,
                "LNAME" => $lName,
                "AGE" => $age,
            ];

            $data = [
                "fname" => $fName,
                "lname" => $lName,
                "age" => $age,
            ];

            session()->set($data);
            $this->accountModel->update($id, $teacherData);