app/Controllers/Home.php

    public function homepage()
    {
        if(session()->has('classID')){
            $class_id = session()->get('classID');
            $queryBuilder = $this->gradesectionModel->where('ID', $class_id)
                ->first();
                if($queryBuilder){
                    $grade = $queryBuilder['YEAR'];
                    $section = $queryBuilder['SECTION'];
                    $getStudents = $this->studentModel->select("*")->WHERE("GRADE", $grade)->WHERE("SECTION", $section)->get();
                    $notification = $this->studentModel->select("*")->where("GRADE", $grade)->WHERE("SECTION", $section)->WHERE("STATUS", 1)->countAllResults();
---
SELECT *
FROM `gradesection`
WHERE `ID` = '1'
 LIMIT 1
SELECT *
FROM `student`
WHERE `GRADE` = '1'
AND `SECTION` = 'MERCURY'
SELECT COUNT(*) AS `numrows`
FROM `student`
WHERE `GRADE` = '1'
AND `SECTION` = 'MERCURY'
AND `STATUS` = 1

    public function student_records()
    {   $class_id = session()->get('classID');
        $queryBuilder = $this->gradesectionModel->where('ID', $class_id)
            ->first();
        $studentBuilder = $this->studentModel->select('*')->WHERE("GRADE",$queryBuilder['YEAR'])->WHERE('SECTION', $queryBuilder['SECTION'])->get();
---
SELECT *
FROM `gradesection`
WHERE `ID` = '1'
 LIMIT 1
SELECT *
FROM `student`
WHERE `GRADE` = '1'
AND `SECTION` = 'MERCURY'

    public function teacher_setting(){
        $id = session()->get('id');
        $getData = $this->accountModel->where('ID', $id)
                ->first();
---
SELECT *
FROM `account`
WHERE `ID` = '2'
 LIMIT 1

    public function student_year($year = 0)
    {
        $getYear = $year;
        $queryBuilder = $this->gradesectionModel->select("*")->where("YEAR", $getYear)->get();
---
SELECT *
FROM `gradesection`
WHERE `YEAR` = '1'

    public function student_section($year = 0, $section = "")
    {
        $getYear = $year;
        $getSection = $section;
        $queryBuilder = $this->studentModel->select("*")->where("GRADE", $getYear)->where("SECTION", $getSection)->get();
---
SELECT *
FROM `student`
WHERE `GRADE` = '1'
AND `SECTION` = 'MERCURY'

    public function event()
    {
        if(session()->has('classID')){
            $class_id = session()->get('classID');
            $queryBuilder = $this->gradesectionModel->where('ID', $class_id)
                ->first();
                if($queryBuilder){
                    $grade = $queryBuilder['YEAR'];
                    $section = $queryBuilder['SECTION'];
                    $getStudents = $this->studentModel->select("*")->WHERE("GRADE", $grade)->WHERE("SECTION", $section)->get();
                    $notification = $this->studentModel->select("*")->where("GRADE", $grade)->WHERE("SECTION", $section)->WHERE("STATUS", 1)->countAllResults();
                    $data = [
                        "notification_number" => $notification,
                        "section" => ucfirst(strtolower($section)),
                        "grade" => $grade + 6,

                    ];
                    session()->set($data);
                    $queryBuilder = $this->eventModel->select('*')
                        ->get();
---
SELECT *
FROM `gradesection`
WHERE `ID` = '1'
 LIMIT 1
SELECT *
FROM `student`
WHERE `GRADE` = '1'
AND `SECTION` = 'MERCURY'
SELECT COUNT(*) AS `numrows`
FROM `student`
WHERE `GRADE` = '1'
AND `SECTION` = 'MERCURY'
AND `STATUS` = 1
SELECT *
FROM `event`

    public function notification(){
        if(session()->has('classID')){
            $class_id = session()->get('classID');
            $queryBuilder = $this->gradesectionModel->where('ID', $class_id)
                ->first();
                if($queryBuilder){
                    $grade = $queryBuilder['YEAR'];
                    $section = $queryBuilder['SECTION'];
                    $getStudents = $this->studentModel->select("*")->WHERE("GRADE", $grade)->WHERE("SECTION", $section)->get();
                    $notification = $this->studentModel->select("*")->where("GRADE", $grade)->WHERE("SECTION", $section)->WHERE("STATUS", 1)->countAllResults();
---
SELECT *
FROM `gradesection`
WHERE `ID` = '1'
 LIMIT 1
SELECT *
FROM `student`
WHERE `GRADE` = '1'
AND `SECTION` = 'MERCURY'
SELECT COUNT(*) AS `numrows`
FROM `student`
WHERE `GRADE` = '1'
AND `SECTION` = 'MERCURY'
AND `STATUS` = 1

    public function section_list(){
        $queryBuilder = $this->teacherSectionsModel->select("*")->get();
        $sectionListData = array();
        if(count($queryBuilder->getResult()) > 0){
            foreach($queryBuilder->getResult() as $result){
                $gradeSectionID = $result->GRADE_SECTION_ID;
                $querySections = $this->gradesectionModel->select("*")->WHERE("ID",$gradeSectionID)->get();
                if(count($querySections->getResult()) > 0){
                    $querySections = $querySections->getRow();
---
SELECT *
FROM `gradesection`
WHERE `ID` = '1'
 LIMIT 1

    public function section_attendance($section = "", $grade = 0, $gradeSectionID = 0){
        $GRADE_SECTION_ID = $gradeSectionID;
        $grade = $grade;
        $section = $section;
        $teacherID = session()->get("id");

        date_default_timezone_set('Asia/Manila');
        $date_today = date("Y-m-d");
        $queryBuilder = $this->studentAttendance->select("*")->WHERE("GRADE_SECTION_ID", $GRADE_SECTION_ID)->WHERE("DATE", $date_today)->WHERE("TEACHER_ID", $teacherID)->get();
        if(count($queryBuilder->getResult()) > 0){
            $validateAttendanceToday = false;
            $result = "";
            $attendance_data = array();
            $student_id = "";
            foreach($queryBuilder->getResult() as $test){
                $result = $test->DATE_START;
                $student_id = $test->STUDENT_ID;
                $studentQuery = $this->studentModel->select("*")->WHERE("ID",$student_id)->get();
                $studentQuery = $studentQuery->getRow();
---
SELECT *
FROM `student_attendance`
WHERE `DATE` = '2022-09-29'
SELECT *
FROM `student`
WHERE `GRADE` = '1'
AND `SECTION` = 'MERCURY'
SELECT *
FROM `student_attendance`
WHERE `GRADE_SECTION_ID` = '1'
AND `DATE` = '2022-11-13'
AND `TEACHER_ID` = '1'
SELECT *
FROM `student`
WHERE `ID` = '1'