app/Controllers/Login.php

SELECT *
FROM `account`
WHERE `USERNAME` = 'nasrollah'
 LIMIT 1
---
  public function verifyData()
  {

    helper(['form']);
    if ($this->request->getMethod() == 'post') {
      $username = $this->request->getVar('username');
      $password = $this->request->getVar('password');
      $usertype = $this->request->getVar('usertype');

      $getDetails = $this->accountModel->where('USERNAME', $username)
        ->first();